inference/inference-Leonardo/results/vllm/sharegpt/Mistral-7B-Instruct-v0.3/Nodes_2-GPUs_4-TP_8-PP_1/launch-1/logs_benchmarking_400-concurrency.log
INFO 09-15 17:18:39 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=2950, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/benchmarks/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=400, model='/leonardo_scratch/large/userinternal/rscheda0/models/Mistral-7B-Instruct-v0.3', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_scratch/large/userinternal/rscheda0/benchmarks/inference/inference-Leonardo/results/vllm/sharegpt/Mistral-7B-Instruct-v0.3/Nodes_2-GPUs_4-TP_8-PP_1/launch-1/Concurrency_400.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 400
============ Serving Benchmark Result ============
Successful requests:                     875       
Benchmark duration (s):                  50.31     
Total input tokens:                      178083    
Total generated tokens:                  197945    
Request throughput (req/s):              17.39     
Output token throughput (tok/s):         3934.37   
Total Token throughput (tok/s):          7473.96   
---------------Time to First Token----------------
Mean TTFT (ms):                          4176.33   
Median TTFT (ms):                        5042.47   
P99 TTFT (ms):                           9328.04   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          48.47     
Median TPOT (ms):                        50.44     
P99 TPOT (ms):                           60.93     
---------------Inter-token Latency----------------
Mean ITL (ms):                           46.43     
Median ITL (ms):                         49.46     
P99 ITL (ms):                            54.79     
==================================================